src/DataProcessors/Отладка_СформироватьОтчетПоВерсиямХранилища.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Отладка_СформироватьОтчетПоВерсиямХранилища</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/DataProcessors/Отладка_СформироватьОтчетПоВерсиямХранилища/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ВыполнитьНаСервере()
	
	Если не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Результат = КонвертацияХранилища.СФормироватьПараметрыИВыгрузитьВерсии(Объект.ИБ,Объект.КаталогВременныхФайлов);
	
	Объект.Хранилище = Результат.Хранилище;
	Объект.ИмяФайлаОтчета = Результат.ИмяФайлаОтчета;

	
	сообщить("ок");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьЗадачу(Команда)
	ВыполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура Выполнить2НаСервере()
	
	Справочники.ВерсииХранилища.ЗагрузитьВерсииИзОтчета(Объект.Хранилище, Объект.ИмяФайлаОтчета);
	сообщить("ок");
	
КонецПроцедуры

&НаКлиенте
Процедура Выполнить2(Команда)
	Выполнить2НаСервере();
КонецПроцедуры
